In [2]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [ ]:
Q1. Write a code to print the data present in the second row of the dataframe, df.

In [6]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [ ]:
Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

loc and iloc are two important functions in Pandas DataFrame used to access rows and columns of a DataFrame.

loc is used to select rows and columns by label. It takes the row and column labels as arguments, separated by a comma. 

iloc is used to select rows and columns by integer position. It takes the row and column positions as arguments, separated by a comma.

In [ ]:
Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].
Did you observe any difference in both the outputs? If so then explain it.

In [11]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [4]:
reindex=[3,0,1,2] 
new_df = pd.DataFrame(df, index=reindex)

In [5]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [26]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [27]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [ ]:
Yes, it has a lot difference between  Indexlocation and location

In [6]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [ ]:
Index_location

As we see the above data the data had just renamed the index but actully always index 0 and ends at n
it above data is just rename the index as 3,0,1,2

As real if we fetch the iloc[2]
Actuall  rechanged
Index    Index 
0         3         Data Engineer	    4     
1         0      	Data Science	    2
2         1	        Machine Learning	3
3         2	        Big Data	        6

In [ ]:
Location

As we saw above it start with 0 and ends at n in index_location.But, as in 
location the index start with 1 and ends at n.

Actuall  Rechanged
location   Index 
1         3         Data Engineer	    4     
2         0      	Data Science	    2
3         1	        Machine Learning	3
4         2	        Big Data	        6

In [ ]:
Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’

In [7]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]

df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [9]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.774953  0.066597  0.210176  0.117940  0.187737  0.512489
2  0.973501  0.065914  0.344291  0.047390  0.875264  0.054116
3  0.201115  0.514620  0.846943  0.793587  0.720522  0.721330
4  0.328885  0.591442  0.621215  0.911993  0.979621  0.399976
5  0.691518  0.411053  0.943492  0.124385  0.942551  0.265320
6  0.115679  0.496922  0.136793  0.465464  0.543778  0.583823

In [10]:
df1.head()

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.774953  0.066597  0.210176  0.117940  0.187737  0.512489
2  0.973501  0.065914  0.344291  0.047390  0.875264  0.054116
3  0.201115  0.514620  0.846943  0.793587  0.720522  0.721330
4  0.328885  0.591442  0.621215  0.911993  0.979621  0.399976
5  0.691518  0.411053  0.943492  0.124385  0.942551  0.265320

In [28]:
data_ =df1.columns

In [29]:
data_

Index(['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6'], dtype='object')

In [38]:
column_1_data = df1['column_1']

In [39]:
column_2_data = df1['column_2']

In [40]:
column_3_data =  df1['column_3']

In [41]:
column_4_data =  df1['column_4']

In [42]:
column_5_data =  df1['column_5']

In [43]:
column_6_data =  df1['column_6']

In [44]:
def mean_of_each(data2):
        print("The mean of the data: ",data2.mean())

In [46]:
mean_of_each(column_1_data)

The mean of the data:  0.5142749855749982

In [52]:
mean_of_each(column_2_data)

The mean of the data:  0.3577579030896619

In [48]:
mean_of_each(column_3_data)

The mean of the data:  0.5171517506512063

In [49]:
mean_of_each(column_4_data)

The mean of the data:  0.4101265867617707

In [50]:
mean_of_each(column_5_data)

The mean of the data:  0.7082454972453488

In [51]:
mean_of_each(column_6_data)

The mean of the data:  0.42284223192069764

In [ ]:
(ii) standard deviation of column, ‘column_2’

In [55]:
std_data_of_column_2 = df1['column_2'].std()

In [56]:
std_data_of_column_2

0.23296730576554867

In [ ]:
Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
If you are getting errors in executing it then explain why.
[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [68]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.406285  0.406285  0.406285  0.406285  0.406285  0.406285
2  0.414373  0.414373  0.414373  0.414373  0.414373  0.414373
3  0.472449  0.472449  0.472449  0.472449  0.472449  0.472449
4  0.465420  0.465420  0.465420  0.465420  0.465420  0.465420
5  0.444417  0.444417  0.444417  0.444417  0.444417  0.444417
6  0.115679  0.496922  0.136793  0.465464  0.543778  0.583823

In [69]:
df1['column_2'] = df1.loc[2]="string variable"

In [ ]:
mean_data = df1['column_2'].mean()

if i  try to replace the data present in the second row of column 'column_2' with a string variable using the code df1.iloc[1,1] = 'string_variable', i will get a TypeError, because iam are trying to assign a string value to a cell that contains a float value.

In [ ]:
Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

In pandas, a window function is a way of performing calculations on a subset of a DataFrame or Series defined by a sliding window. It allows us to compute the value for each element in the window based on the values of the neighboring elements within the window.

Pandas provides several types of window functions that can be used for data analysis and feature engineering. These include:

Rolling window functions: This type of window function is applied to a rolling window of a fixed size that slides over the data. Common examples of rolling window functions include the rolling sum, rolling mean, rolling max, and rolling min.

Expanding window functions: This type of window function includes all the previous rows along with the current row. Examples of expanding window functions include the expanding sum, expanding mean, and expanding max.

Exponentially-weighted window functions: This type of window function gives more weight to recent values in the window and less weight to older values. Examples of exponentially-weighted window functions include the exponentially-weighted mean and exponentially-weighted standard deviation.

Cumulative window functions: This type of window function aggregates the values up to the current row. Examples of cumulative window functions include the cumsum and cumprod functions.

Window functions are useful for time series data analysis, feature engineering, and exploratory data analysis. They allow us to easily calculate rolling or expanding statistics, detect trends and anomalies, and perform other types of data transformations.

In [ ]:
Q7. Write a code to print only the current month and year at the time of answering this question.
[Hint: Use pandas.datetime function]

In [80]:
import pandas as pd
import datetime

In [82]:
month_year = datetime.datetime.now()

In [90]:
current_month=month_year.strftime('%m')

In [87]:
current_year=month_year.strftime('%Y')

In [100]:
time = datetime.datetime.now()
current_time = time.strftime('%H:%M:%S')

In [101]:
print(f'The month is {current_month} and Year is {current_year} and the time is {current_time} .')

The month is 03 and Year is 2023 and the time is 13:59:49 .

In [ ]:
Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.

In [ ]:
import pandas as pd

start_date = input("Enter start date (YYYY-MM-DD): ")
end_date = input("Enter end date (YYYY-MM-DD): ")

start_datetime = pd.to_datetime(start_date)
end_datetime = pd.to_datetime(end_date)

timedelta = end_datetime - start_datetime

days = timedelta.days
hours = timedelta.seconds // 3600
minutes = (timedelta.seconds % 3600) // 60

print(f"The difference between {start_date} and {end_date} is:")
print(f"{days} days, {hours} hours, and {minutes} minutes.")

In [ ]:
Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified
column to a categorical data type. The program should prompt the user to enter the file path, column
name, and category order, and then display the sorted data.

In [ ]:
import pandas as pd

file_path = input("Enter CSV file path: ")


df = pd.read_csv(file_path)


column_name = input("Enter column name: ")
category_order = input("Enter category order (comma-separated list): ").split(",")


df[column_name] = pd.Categorical(df[column_name], categories=category_order, ordered=True)


df_sorted = df.sort_values(by=column_name)


print(df_sorted)

In [ ]:
Q10. Write a Python program that reads a CSV file containing sales data for different products and
visualizes the data using a stacked bar chart to show the sales of each product category over time. The
program should prompt the user to enter the file path and display the chart.

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

file_path = input("Enter CSV file path: ")

df = pd.read_csv(file_path)

df['Date'] = pd.to_datetime(df['Date'])


grouped_data = df.groupby(['Date', 'Product Category'])['Sales'].sum().reset_index()

pivoted_data = grouped_data.pivot(index='Date', columns='Product Category', values='Sales')


pivoted_data.plot(kind='bar', stacked=True)

plt.title('Sales by Product Category over Time')
plt.xlabel('Date')
plt.ylabel('Sales')

plt.show()

In [ ]:
Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write
a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and
displays the results in a table.
The program should do the followingM
I Prompt the user to enter the file path of the CSV file containing the student dataR
I Read the CSV file into a Pandas DataFrameR
I Calculate the mean, median, and mode of the test scores using Pandas toolsR
I Display the mean, median, and mode in a table.
Assume the CSV file contains the following columnsM
I Student ID: The ID of the studentR
I Test Score: The score of the student's test.
Example usage of the program:
Enter the file path of the CSV file containing the student data: student_data.csv
+-----------+--------+
| Statistic | Value |
+-----------+--------+
| Mean | 79.6 |
| Median | 82 |
| Mode | 85, 90 |
+-----------+--------+
Assume that the CSV file student_data.csv contains the following data:
Student ID,Test Score
1,85
2,90
3,80
4,75
5,85
6,82
7,78
8,85
9,90
10,85
The program should calculate the mean, median, and mode of the test scores and display the results
in a table.

In [ ]:
import pandas as pd

csv_path = input("Enter the file path of the CSV file containing the student data: ")

data = pd.read_csv(csv_path)

mean = data["Test Score"].mean()
median = data["Test Score"].median()
mode = data["Test Score"].mode()

table_data = {"Statistic": ["Mean", "Median", "Mode"],"Value": [mean, median, ", ".join(str(x) for x in mode)]}
table = pd.DataFrame(table_data)
print(table)